import React from "react";

export default function AboutContent() {
  return (
    <div className="aboutcontent mt-16">
      <div className="container">
        <div className="content flex flex-col items-center justify-center pt-12">
          <img src="/images/logofooter.png" alt="" />
          <p className="p-2 mt-4 border-solid border-gmain border-x-2 rounded-lg">
            به <span className="text-gmain font-bold">"تاجَک"</span> خوش آمدید، جایی که همه‌ی شما عاشقان کتاب‌ها و دنیای
            مطالعه را در انتظار داریم. ما با افتخار به شما مجموعه‌ای گسترده از
            کتاب‌های متنوع و شگفت‌انگیز را ارائه می‌دهیم. از رمان‌های جذاب گرفته
            تا آثار ادبی کلاسیک، از کتاب‌های علمی تا کتاب‌های کودکانه، در
            <span className="text-gmain font-bold">"تاجَک"</span> همه چیز برای شماست. ما به اهمیت مطالعه و دسترسی به دانش باور
            داریم و به همین دلیل، به شما امکان می‌دهیم تا با خیال راحت و بدون
            هیچ محدودیتی، کتاب‌های خود را انتخاب کنید. هدف ما فراهم کردن یک فضای
            شگفت‌انگیز برای دسترسی به دنیای کتاب‌ها و دانش است. ما به شما این
            امکان را می‌دهیم تا در کنار همه‌ی امور روزمره، به فضایی که تخصصی
            برای کتاب‌ها اختصاص دارد، ورود کنید. اعتقاد داریم که هر کتابی دارای
            دنیای خودش است و هر فردی با دست‌یافتن به یک کتاب، به یک سفر جدید و
            دیدگاه‌های جدید را تجربه می‌کند. از این رو، در <span className="text-gmain font-bold">"تاجَک"</span> تنوع کتاب‌ها
            به عنوان یک ارزش بزرگ شناخته می‌شود. در <span className="text-gmain font-bold">"تاجَک"</span>، ما به توسعه فرهنگ
            مطالعه و اهمیت کتاب‌ها در زندگی انسان‌ها پاسخگویی می‌کنیم. از همین
            رو به همه‌ی علاقه‌مندان به کتاب و دانش دسترسی راحت و مطمئن به
            کتاب‌های مختلف را فراهم می‌آوریم. ما به همراه شما هستیم تا در این
            سفر پر از دانش و اشتیاق، همیشه در کنارتان باشیم.
          </p>
        </div>
      </div>
    </div>
  );
}
